Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/irish_social_welfare_system/social_insurance_prsi/employer_s_duty_to_pay_social_insurance_prsi.html.txt.tmx
Source language: en
Languages: ga

source: Paying social insurance (PRSI)
ga: Dualgas an fhostóra árachas sóisialta (ÁSPC) a íoc

source: Most employed people over 16 years of age make social insurance contributions
ga: Íocann an chuid is mó de dhaoine fostaithe d'aois os cionn 16 bliana ranníocaíocht i dtreo árachais sóisialta

source: The amount you pay is based on your earnings and the type of work you do
ga: Tá an méid a íocann tú bunaithe ar do chuid tuillimh agus ar an gcineál oibre a dhéanann tú

source: For this reason it is called Pay Related Social Insurance (PRSI)
ga: Ar an gcúis seo glaoitear Árachas Sóisialta Pá-Choibhneasa (ÁSPC) air

source: The law makes your employer responsible for PRSI, though you may have to pay an employee's share
ga: I bhfírinne, déanann an dlí d'fhostóir freagrach as ÁSPC, cé go mb'fhéidir go mbeidh ort scair an fhostaí a íoc

source: The amount of PRSI paid by you and your employer depends on your social insurance class
ga: Tá an méid ÁSPC a íocann tú féin agus d'fhostóir ag brath ar d'aicme árachais shóisialta

source: Your social insurance class is in turn determined by your earnings and the type of work you do
ga: Tá d'aicme árachais shóisialta ina theannta sin ag brath ar do chuid tuillimh agus ar an gcineál oibre a dhéanann tú

source: You can find more information in our document on social insurance classes
ga: Léigh anseo chun breis faisnéise a fháil ar na haicmí árachais shóisialta difriúla

source: Your employer deducts your PRSI contribution directly from your wages
ga: Baineann d'fhostóir do ranníocaíocht ÁSPC go díreach as do chuid pá

source: It is then collected by Revenue and a record of your contributions is kept by both your employer and the Department of Social Protection
ga: Déanann na Coimisinéirí Ioncaim ansin é a bhailiú agus coinníonn d'fhostóir agus an Roinn Coimirce Sóisialaí araon taifead ar do chuid ranníocaíochtaí

source: Under the Payment of Wages Act 1991, you must be given a pay slip when you are paid
ga: San Acht um Íoc Pá 1991, caithfear duillín pá a thabhairt duit nuair a íoctar tú

source: The PRSI contribution deducted should be noted on your pay slip
ga: Caithfear an asbhaint an ÁSPC bheith nótáilte ar do dhuillín pá

source: Your employer also pays PRSI contributions for you
ga: Íocann d'fhostóir ranníocaíochtaí ÁSPC thar do cheann chomh maith

source: This contribution is not deducted from your pay
ga: Ní bhaintear an t-airgead (ranníocaíocht) seo as do chuid pá

source: It is your employer's contribution to the Social Insurance Fund
ga: Is é sin ranníocaíocht d'fhostóra féin don Chiste Árachais Sóisialta náisiúnta

source: Again, this is collected by Revenue and a record of the contribution is kept by the Department of Social Protection
ga: Déanann na Coimisinéirí Ioncaim é seo a bhailiú agus tá taifead den ranníocaíocht coinnithe ag an Roinn Coimirce Sóisialaí

source: The Department publishes information for employers - Employers' guide to the Pay-Related Social Insurance (PRSI) contribution system - SW 3
ga: Foilsíonn an Roinn faisnéis d'fhostóirí - Treoir an Fhostóra ar an gcóras ranníocaíochta Árachais Sóisialta Pá-Choibhneasa (ÁSPC) SW3

source: Your employer needs your Personal Public Service Number to make PRSI contributions for you
ga: Teastaíonn d'Uimhir Phearsanta Seirbhíse Poiblí (UPSP) ó d'fhostóir chun ranníocaíochtaí árachais sóisialta a dhéanamh thar do cheann

source: If your employer does not make the correct PRSI contribution, your employer will be held responsible for the cost of the entire contribution and any arrears that may be due
ga: Mura ndéanann d'fhostóir an ranníocaíocht ÁSPC ceart, beidh d'fhostóir freagrach as costas na ranníocaíochta iomláine agus aon riaráistí a bheadh le híoc

source: Failure to meet this responsibility can mean that PRSI which has not been paid can be recovered in court as a debt to the State
ga: D’fhéadfadh sé a bheith mar thoradh ar theipeadh ar an bhfreagracht seo go bhféadfaí ÁSPC nár íocadh a aisghabháil sa chúirt mar fhiacha ag an Stát

source: If your employer does not make PRSI contributions on your behalf they may be required to repay to the Department certain social welfare payments you may have received illegally while working for them (these benefits include Illness Benefit, Jobseeker's Benefit, Jobseeker's Allowance, Pre Retirement Allowance, Invalidity Pension, and Family Income Supplement)
ga: Mura ndéanann d'fhostóir ranníocaíochtaí ÁSPC thar do cheann, d'fhéadfadh go mbeadh dualgas ar d'fhostóir íocaíochtaí leasa shóisialaigh áirithe, a fuair tú go neamhdhlíthiúil agus tú ag obair dó, aisíoc leis an Roinn. D’fhéadfadh go mbeadh d’fhostóir freagrach freisin as aon sochar a chaill tú de thoradh nár íoc sé ranníocaíochtaí ÁSPC thar do cheann

source: Your employer may also be liable for any benefit you have lost as a result of them not paying PRSI contributions on your behalf or for repayment of social welfare assistance paid to you in lieu of lost benefit
ga: Chomh maith leis d’fhéadfadh go mbeadh d’fhostóir freagrach as aisíoc cúnamh leasa shóisialaigh a n-íocadh leat in áit sochar caillte

source: Every year, inspectors from the Department of Social Protection visit many employers
ga: Gach bliain, tugann cigirí na Roinne Coimirce Sóisialaí cuairt ar mórán fostóirí

source: The purpose of these inspections is to find employers that:
ga: Is é cuspóir na iniúchtaí ná fostóirí a aimsiú:

source: • Do not pay any PRSI contributions for their employees
ga: • Nach n-íocann aon ranníocaíochtaí ÁSPC dá bhfostaithe

source: • Do not keep proper records for them
ga: • Nach gcoinníonn taifid chuí díobh

source: • Encourage employees to claim jobseeker payments
ga: • A spreagann fostaithe chun íocaíochtaí dífhostaíochta a éileamh

source: • Understate wages being paid to employees
ga: • A dhéanann ganniontráil ar an bpá atá á íoc le fostaithe

source: The Department's inspectors have power to inspect records and there are penalties for people who obstruct or refuse to supply information, or fail to keep or produce records and documents
ga: Tá cumhacht ag cigirí na Roinne taifid a iniúchadh agus tá pionóis do dhaoine a chuireann bac ar nó a dhiúltaíonn faisnéis a sholáthar, nó a theipeann orthu taifid agus doiciméid a choinneáil agus a tháirgeadh

source: In some cases, PRSI contributions from employees who are insurable under Irish social security legislation but do not come within the PAYE system are collected by the Special Collection System operated by the Department of Social Protection
ga: I gcásanna áirithe, ní chaithfidh fostóirí a scair den ÁSPC a íoc d'fhostaithe. Ní mór fostaithe a scair ÁSPC a íoc fós, áfach, seachas más oibrithe atá seolta go hÉirinn iad - féach thíos

source: EU Regulations and bilateral social security agreements allow posted workers, who are sent by their employer on short work assignments from Ireland to the other country, to remain subject to Irish PRSI instead of transferring to the social security system of the other country
ga: Ó 1 Eanáir 2014 tá an ráta ÁSPC fostóra níos ísle 8.5% le haghaidh iomlán jabanna a íocann suas go €356 sa tseachtain. (Bhí an ráta ÁSPC fostóra níos ísle laghdaithe faoina leath (go 4.25%) ó 1 Iúil 2011 agus bhí an ráta curtha ar ais go 8.5% ó 1 Eanáir 2014.)

source: For example, if you are employed in Ireland and your employer sends you to work temporarily abroad in another EU state you will remain subject to the Irish PRSI system and will continue to pay PRSI for 24 months
ga: Scéim Dreasachta Jabanna (ÁSPC) i gcomhair Fostóirí Bhí an Scéim Dreasachta Jabanna (ÁSPC) i gcomhair Fostóirí oscailte d’fhostóirí a chruthaíonn jabanna nua agus jabanna breise

source: Your employer must complete an A1 form (formerly E101) certificate (available from the PRSI Special Collection Unit) for inspection by the social security authorities in the member state where you are sent to work
ga: Faoin scéim seo, níor ghá d’fhostóirí scair an fhostóra de ranníocaíochtaí ÁSPC i leith fostaithe áirithe a íoc ar feadh 18 mhí. Ó 1 Iúil 2013 níl sé i bhfeidhm a thuilleadh

source: More information is available on the Special Collection System (SW 63)
ga: Faigh amach tuilleadh faoin Scéim Dreasachta Jabanna (ÁSPC) i gcomhair Fostóirí

source: If an employer sends you to work temporarily in a country not covered by EU Regulations or to a country with which Ireland does not have a Bilateral Social Security Agreement, you remain liable for Irish PRSI contributions for up to 12 months
ga: Oibrí sannta in Éirinn Má tá oibrí ina c(h)ónaí i dtír nach bhfuil clúdaithe ag Rialúcháin an AE, nó nach bhfuil Comhaontú Déthaobhach Slándála Sóisialaí ag Éirinn leo agus má chuirtear é/í ag obair ghearrthéarmach in Éirinn ag fostóir nach bhfuil cláraithe in Éirinn nó nach bhfuil príomhionad an ghnó acu in Éirinn, i dTuaisceart Éireann, sa Bhreatain nó Oileán Mhanann, d’fhéadfadh sé/í a bheith díolmhaithe ó ranníocaíochtaí ÁSPC na hÉireann a íoc ar feadh tréimhse suas go dtí 12 mhí. Ag íoc ranníocaíochtaí ÁSPC le linn breoiteachta Má íocann d'fhostóir tú nuair atá tú breoite, leanfaidh tú ag íoc ÁSPC

source: If the employment exceeds 12 months, it may be possible to remain liable for Irish PRSI for longer than 12 months
ga: Sa chás seo, ní íocann d'fhostóir ach ranníocaíocht ÁSPC ar an méid pá breoiteachta lúide an méid Sochair Breoiteachta

source: Employees working abroad who are not subject to the Irish PRSI system may opt to pay voluntary contributions
ga: Mura n-íocann d'fhostóir tú nuair atá tú as obair trí bhreoiteacht, níl aon ranníocaíochtaí ÁSPC le híoc

source: Workers posted to Ireland
ga: Ag fostú baill teaghlaigh agus ÁSPC

source: A worker who is ordinarily resident in a country not covered by EU Regulations, or with which Ireland does not have a Bilateral Social Security Agreement and who is sent to work temporarily in Ireland by an employer who is not ordinarily registered in Ireland nor has their principal place of business in Ireland, Northern Ireland, Great Britain or the Isle of Man, may be exempt from paying Irish PRSI contributions for up to 12 months
ga: Má tá tú fostaithe mar fhostaí ag gaol forordaithe agus nach bhfuil an fhostaíocht bhainteach le teach cónaithe príobháideach nó feirm ina bhfuil nó ar a bhfuil cónaí ort féin agus an fostóir (baineann ÁSPC Aicme A nó Aicme J). Má tá tú fostaithe mar phrintíseach ag gaol forordaithe (fiú amháin má bhaineann fostaíocht na printíseachta le teach cónaithe príobháideach nó feirm ina bhfuil nó ar a bhfuil cónaí ort féin agus an fostóir) caithfidh Conradh Printíseachta cláraithe a bheith i gceist (baineann ÁSPC Aicme A nó Aicme J)

source: Paying PRSI contributions during illness
ga: • Má tá tú fostaithe mar fhostaí ag do chéilí nó do pháirtnéir sibhialta

source: If your employer pays you when you are sick, you will continue to pay PRSI
ga: • Má chuidíonn tú nó má ghlacann tú páirt i reáchtáil an ghnó teaghlaigh, ach ní mar fhostaí

source: Some employers will continue to pay you when you are out of work due to illness provided you hand over to your employer any Illness Benefit payment you get from the Department of Social Protection
ga: (Mar shampla, mac/iníon atá ag freastal go lánaimseartha ar oideachas a ghlacann páirt sa ghnó tar éis uaireanta scoile (m.sh

source: In this case, your employer only pays a PRSI contribution on the amount of sick pay minus the amount of Illness Benefit
ga: feirm) nó céile/páirtnéir sibhialta a dhéanann an obair chuntasaíochta don ghnó a chomhlíonadh - ach nach fostaí iad)

source: If your employer pays you when you are ill and allows you to keep your Illness Benefit payment, your employer's PRSI contribution is paid on the full amount of the sick pay, ignoring the Illness Benefit payment
ga: Pointí le tabhairt faoi deara: Úsáidtear ÁSPC Aicme M chun cásanna a thaifead nach bhfuil dliteanas ar bith i gceist do cheachtar d'árachas sóisialta

source: If your employer does not pay you when you are absent from work through illness, no PRSI contributions are due
ga: Ag brath ar choinníollacha áirithe, má thagann deireadh le do chlúdach ag ÁSPC éigeantach, d'fhéadfá rogha a dhéanamh a bheith faoi árachas ar bhonn deonach agus ranníocaíochtaí deonacha a íoc

source: The amount of PRSI you and your employer pay will depend on your earnings and the social insurance class you are insured under
ga: Beidh an méid ÁSPC a íocann tú féin agus d'fhostóir ag brath ar do chuid tuillimh agus an Aicme Árachais Shóisialta ina bhfuil tú faoi árachas

source: If you are earning less than €352 gross per week (before tax is deducted), you will not pay any social insurance
ga: Má tá níos lú ná €352 á thuilleamh agat ar an iomlán sa tseachtain (sula mbaintear cáin), ní íocfaidh tú aon árachas sóisialach

source: This does not mean that you are not getting a contribution
ga: Ní chiallaíonn seo nach bhfuil ranníocaíocht á fáil agat

source: You are still covered by Class A social insurance
ga: Tá tú cumhdaithe go fóill ag árachas sóisialach Aicme A

source: Your employer is paying social insurance on your behalf
ga: Tá árachas sóisialach á íoc ag d’fhostóir thar do cheann

source: If you earn over €352 per week, you pay 4% PRSI on all your earnings
ga: Má thuilleann tú breis agus €352 sa tseachtain, íocann tú ÁSPC 4% ar do thuillimh go léir

source: A new PRSI credit was introduced in 2016 which reduces the amount of PRSI payable for people earning between €352.01 and €424 per week
ga: Tugadh creidmheas nua ÁSPC isteach in 2016, a laghdaíonn an méid ÁSPC atá iníoctha do dhaoine a thuilleann idir €352.01 agus €424 sa tseachtain

source: The credit is tapered and the amount of the credit depends on your earnings
ga: Tá an creidmheas barrchaolaithe agus braitheann méid an chreidmheasa ar do chuid tuilleamh

source: The maximum credit is €12
ga: Is é an creidmheas uasta €12

source: For example, if you earn €352.01 per week, you will get the maximum PRSI credit of €12
ga: Mar shampla, má thuilleann tú €352.01 sa tseachtain, gheobhaidh tú an creidmheas uasta ÁSPC €12

source: On these earnings of €352.01, your PRSI charge (calculated at 4% of your earnings) would be €14.08
ga: I dtaobh na dtuilleamh €352.01 seo, b’ionann a bheadh do mhuirear ÁSPC (a ríomhtar amhail 4% de do chuid tuilleamh) agus €14.08

source: After the €12 credit is deducted, you will pay PRSI of €2.08
ga: I ndiaidh go n-asbhaintear an creidmheas €12, íocfaidh tú ÁSPC €2.08

source: If you earn between €352.01 and €424 per week, the maximum credit of €12 is reduced by one-sixth of the amount of your weekly earnings over €352.01
ga: Má thuilleann tú idir €352.01 agus €424 sa tseachtain, laghdaítear an creidmheas uasta €12 faoin séú cuid de mhéid do thuilleamh seachtainiúil os cionn €352.01

source: You work out how much PRSI you will pay in four steps
ga: Deimhníonn tú cé mhéid ÁSPC a íocfaidh tú i gceithre chéim

source: First, calculate one-sixth of your earnings over €352.01
ga: Ar dtús, déan an séú cuid de do chuid tuilleamh os cionn €352.01 a ríomh

source: Then subtract this from the maximum credit of €12 to get your PRSI credit
ga: Dealaigh seo ón gcreidmheas uasta €12 chun do chreidmheas ÁSPC a dheimhniú

source: Then calculate the basic PRSI charge at 4% of your earnings
ga: Ansin ríomh an bunmhuirear ÁSPC ar 4% de do thuillimh

source: Finally, deduct your PRSI credit from the PRSI charge
ga: Ar deireadh, asbhain do chreidmheas ÁSPC ón muirear ÁSPC

source: The result is the amount of PRSI you pay
ga: Is é an toradh an méid ÁSPC a íocann tú

source: For example, for gross weekly earnings of €377:
ga: Mar shampla, i dtaobh olltuillimh sheachtainiúla €377:

source: One-sixth of your earnings over €352.01 is €377- €352.01 = €24.99, divided by 6 = €4.17
ga: Is é an séú cuid de do thuillimh os cionn €352.01 ná €377-€352.01 = €24.99, roinnte ar 6 = €4.17

source: Subtract this from the maximum credit of €12, giving you a credit of €7.83
ga: Dealaigh seo ón gcreidmheas uasta €12, agus fágtar creidmheas €7.83

source: The basic PRSI charge is 4% of €377 = €15.08
ga: Is é an bunmhuirear ÁSPC 4% de €377 = €15.08

source: You will pay €7.25 PRSI weekly (€15.08 minus your €7.83 PRSI credit)
ga: Íocfaidh tú ÁSPC €7.25 gach seachtain (€15.08 lúide do chreidmheas ÁSPC €7.83)

source: Visit welfare.ie to find out more about the PRSI credit and see examples of calculations for different income levels
ga: Tabhair cuairt ar welfare.ie chun teacht ar bhreis faisnéise faoin gcreidmheas ÁSPC agus chun teacht ar shamplaí de ríomhanna le haghaidh leibhéil éagsúla ioncaim

source: Employers pay 8.5% Class A employer PRSI on weekly earnings up to €376
ga: Íocann fostóirí ÁSPC fostóra Aicme A 8.5% ar thuillimh sheachtainiúla a fhad le €376

source: Employers pay 10.75% Class A employer PRSI on weekly earnings over €376
ga: Íocann fostóirí ÁSPC fostóra Aicme A 10.75% ar thuillimh sheachtainiúla os cionn €376

source: This threshold increased from €356 to €376 on 1 January 2016
ga: Tháinig méadú ar an tairseach seo aníos ó €356 go dtí €376 an 1 Eanáir 2016

source: More information can be found about the amount of PRSI paid in each class
ga: Is féidir leat teacht ar a thuilleadh faisnéise faoin méid ÁSPC a íoctar i ngach aicme

source: Your employer deducts your PRSI contribution from your wages
ga: Baineann d'fhostóir do ranníocaíocht ÁSPC as do chuid pá

source: If you believe that your employer has not complied with social insurance regulations you can ask to fill in form IA49 at your local social welfare office or Intreo centre
ga: Mar fhostaí a íocann ranníocaíochtaí ÁSPC, tá tú i dteideal de réir dlí scrúdú a dhéanamh ar an taifead ÁSPC coinnithe ag d'fhostóir fút nó is féidir leat ráiteas de do thaifead a fháil ó d'fhostóir gach 3 mhí

source: Form IA49 is a declaration stating that you believe your former employer did not comply with social insurance regulations
ga: Is féidir leat teagmháil a dhéanamh chomh maith le Rannóg na dTaifead sa Roinn Coimirce Sóisialaí chun do thaifead ÁSPC a sheiceáil
